app/controllers/tasks_controller.rb

SELECT * FROM `tasks` WHERE (`tasks`.user_id = 1) ORDER BY importance, urgency, position
---
  def index
    @tasks = current_user.tasks.all

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 5 AND (`tasks`.user_id = 1)) ORDER BY position
---
  def show
    @task = current_user.tasks.find(params[:id])

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 6 AND (`tasks`.user_id = 1)) ORDER BY position
---
  def edit
    @task = current_user.tasks.find(params[:id])

INSERT INTO `tasks` (`importance`, `urgency`, `position`, `created_at`, `title`, `updated_at`, `user_id`, `star`) VALUES(1, 1, 2, '2010-02-07 07:48:00', 'Goober', '2010-02-07 07:48:00', 1, 0)
---
  def create
    @task = current_user.tasks.build(params[:task])

    respond_to do |format|
      if @task.save

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 6 AND (`tasks`.user_id = 1)) ORDER BY position
UPDATE `tasks` SET `updated_at` = '2010-02-07 07:48:37', `position` = 2 WHERE `id` = 6
UPDATE `users` SET `updated_at` = '2010-02-07 07:48:37', `last_request_at` = '2010-02-07 07:48:37' WHERE `id` = 1
---
  def update
    @task = current_user.tasks.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])