app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "last_request_at", "crypted_password", "updated_at", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "invitation_code", "last_login_ip", "last_login_at", "email") VALUES('2010-02-07 05:41:55', '2010-02-07 05:41:55', '41e4417a3fe13bb12e71842125f4a627dbb3d50903f3f0f8c4ba0cfb58ba728678094a1078acbe51df2abe1428d24924f4a25e29b853ac5fc8bbcdbc335d64fd', '2010-02-07 05:41:55', '127.0.0.1', 'ceEtnbGS7HH6V5YN6IAE', '2010-02-07 05:41:55', 'd31e713c2d78764e4eacbc55dd9d9be6f723c0d37541c726f887c6a54808464461465f6933674de3ca4ceb09685e13c9660a938528a95d9479b9022e4f53a1ef', 1, '791j28az', NULL, NULL, 'zol@icyte.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save